bench/k6-postfix.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/order-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m15s max duration (incl. graceful stop):
              * order_load: 40 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
order_load   [   2% ] 40 VUs  01.0s/45s

running (0m02.0s), 40/40 VUs, 259 complete and 0 interrupted iterations
order_load   [   4% ] 40 VUs  02.0s/45s

running (0m03.0s), 40/40 VUs, 629 complete and 0 interrupted iterations
order_load   [   7% ] 40 VUs  03.0s/45s

running (0m04.0s), 40/40 VUs, 1019 complete and 0 interrupted iterations
order_load   [   9% ] 40 VUs  04.0s/45s

running (0m05.0s), 40/40 VUs, 1398 complete and 0 interrupted iterations
order_load   [  11% ] 40 VUs  05.0s/45s

running (0m06.0s), 40/40 VUs, 1779 complete and 0 interrupted iterations
order_load   [  13% ] 40 VUs  06.0s/45s

running (0m07.0s), 40/40 VUs, 2168 complete and 0 interrupted iterations
order_load   [  16% ] 40 VUs  07.0s/45s

running (0m08.0s), 40/40 VUs, 2539 complete and 0 interrupted iterations
order_load   [  18% ] 40 VUs  08.0s/45s

running (0m09.0s), 40/40 VUs, 2928 complete and 0 interrupted iterations
order_load   [  20% ] 40 VUs  09.0s/45s

running (0m10.0s), 40/40 VUs, 3309 complete and 0 interrupted iterations
order_load   [  22% ] 40 VUs  10.0s/45s

running (0m11.0s), 40/40 VUs, 3688 complete and 0 interrupted iterations
order_load   [  24% ] 40 VUs  11.0s/45s

running (0m12.0s), 40/40 VUs, 4069 complete and 0 interrupted iterations
order_load   [  27% ] 40 VUs  12.0s/45s

running (0m13.0s), 40/40 VUs, 4458 complete and 0 interrupted iterations
order_load   [  29% ] 40 VUs  13.0s/45s

running (0m14.0s), 40/40 VUs, 4829 complete and 0 interrupted iterations
order_load   [  31% ] 40 VUs  14.0s/45s

running (0m15.0s), 40/40 VUs, 5219 complete and 0 interrupted iterations
order_load   [  33% ] 40 VUs  15.0s/45s

running (0m16.0s), 40/40 VUs, 5608 complete and 0 interrupted iterations
order_load   [  36% ] 40 VUs  16.0s/45s

running (0m17.0s), 40/40 VUs, 5989 complete and 0 interrupted iterations
order_load   [  38% ] 40 VUs  17.0s/45s

running (0m18.0s), 40/40 VUs, 6368 complete and 0 interrupted iterations
order_load   [  40% ] 40 VUs  18.0s/45s

running (0m19.0s), 40/40 VUs, 6749 complete and 0 interrupted iterations
order_load   [  42% ] 40 VUs  19.0s/45s

running (0m20.0s), 40/40 VUs, 7128 complete and 0 interrupted iterations
order_load   [  44% ] 40 VUs  20.0s/45s

running (0m21.0s), 40/40 VUs, 7509 complete and 0 interrupted iterations
order_load   [  47% ] 40 VUs  21.0s/45s

running (0m22.0s), 40/40 VUs, 7909 complete and 0 interrupted iterations
order_load   [  49% ] 40 VUs  22.0s/45s

running (0m23.0s), 40/40 VUs, 8288 complete and 0 interrupted iterations
order_load   [  51% ] 40 VUs  23.0s/45s

running (0m24.0s), 40/40 VUs, 8669 complete and 0 interrupted iterations
order_load   [  53% ] 40 VUs  24.0s/45s

running (0m25.0s), 40/40 VUs, 9048 complete and 0 interrupted iterations
order_load   [  56% ] 40 VUs  25.0s/45s

running (0m26.0s), 40/40 VUs, 9440 complete and 0 interrupted iterations
order_load   [  58% ] 40 VUs  26.0s/45s

running (0m27.0s), 40/40 VUs, 9829 complete and 0 interrupted iterations
order_load   [  60% ] 40 VUs  27.0s/45s

running (0m28.0s), 40/40 VUs, 10208 complete and 0 interrupted iterations
order_load   [  62% ] 40 VUs  28.0s/45s

running (0m29.0s), 40/40 VUs, 10589 complete and 0 interrupted iterations
order_load   [  64% ] 40 VUs  29.0s/45s

running (0m30.0s), 40/40 VUs, 10968 complete and 0 interrupted iterations
order_load   [  67% ] 40 VUs  30.0s/45s

running (0m31.0s), 40/40 VUs, 11368 complete and 0 interrupted iterations
order_load   [  69% ] 40 VUs  31.0s/45s

running (0m32.0s), 40/40 VUs, 11749 complete and 0 interrupted iterations
order_load   [  71% ] 40 VUs  32.0s/45s

running (0m33.0s), 40/40 VUs, 12128 complete and 0 interrupted iterations
order_load   [  73% ] 40 VUs  33.0s/45s

running (0m34.0s), 40/40 VUs, 12509 complete and 0 interrupted iterations
order_load   [  76% ] 40 VUs  34.0s/45s

running (0m35.0s), 40/40 VUs, 12888 complete and 0 interrupted iterations
order_load   [  78% ] 40 VUs  35.0s/45s

running (0m36.0s), 40/40 VUs, 13288 complete and 0 interrupted iterations
order_load   [  80% ] 40 VUs  36.0s/45s

running (0m37.0s), 40/40 VUs, 13669 complete and 0 interrupted iterations
order_load   [  82% ] 40 VUs  37.0s/45s

running (0m38.0s), 40/40 VUs, 14048 complete and 0 interrupted iterations
order_load   [  84% ] 40 VUs  38.0s/45s

running (0m39.0s), 40/40 VUs, 14429 complete and 0 interrupted iterations
order_load   [  87% ] 40 VUs  39.0s/45s

running (0m40.0s), 40/40 VUs, 14808 complete and 0 interrupted iterations
order_load   [  89% ] 40 VUs  40.0s/45s

running (0m41.0s), 40/40 VUs, 15189 complete and 0 interrupted iterations
order_load   [  91% ] 40 VUs  41.0s/45s

running (0m42.0s), 40/40 VUs, 15589 complete and 0 interrupted iterations
order_load   [  93% ] 40 VUs  42.0s/45s

running (0m43.0s), 40/40 VUs, 15968 complete and 0 interrupted iterations
order_load   [  96% ] 40 VUs  43.0s/45s

running (0m44.0s), 40/40 VUs, 16349 complete and 0 interrupted iterations
order_load   [  98% ] 40 VUs  44.0s/45s

running (0m45.0s), 40/40 VUs, 16749 complete and 0 interrupted iterations
order_load   [ 100% ] 40 VUs  45.0s/45s


  █ TOTAL RESULTS 

    checks_total.......: 16789   372.268886/s
    checks_succeeded...: 100.00% 16789 out of 16789
    checks_failed......: 0.00%   0 out of 16789

    ✓ got a response (status != 0)

    CUSTOM
    orders_conflict_409............: 16620  368.521585/s
    orders_servererror_500.........: 149    3.303834/s
    orders_success_200.............: 20     0.443468/s

    HTTP
    http_req_duration..............: avg=7ms      min=1.55ms   med=3.95ms   max=1.15s p(90)=4.77ms   p(95)=5.3ms    p(99)=23.74ms 
      { expected_response:true }...: avg=375.43ms min=38.18ms  med=74.65ms  max=1.15s p(90)=1.09s    p(95)=1.12s    p(99)=1.14s   
    http_req_failed................: 99.88% 16769 out of 16789
    http_reqs......................: 16789  372.268886/s

    EXECUTION
    iteration_duration.............: avg=107.4ms  min=101.89ms med=104.34ms max=1.25s p(90)=105.25ms p(95)=105.69ms p(99)=124.15ms
    iterations.....................: 16789  372.268886/s
    vus............................: 40     min=40             max=40
    vus_max........................: 40     min=40             max=40

    NETWORK
    data_received..................: 4.7 MB 104 kB/s
    data_sent......................: 4.3 MB 96 kB/s



running (0m45.1s), 00/40 VUs, 16789 complete and 0 interrupted iterations
order_load ✓ [ 100% ] 40 VUs  45s