bench/k6-postfix2-multiitem.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/order-load-test-multiitem.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m15s max duration (incl. graceful stop):
              * order_load: 40 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
order_load   [   2% ] 40 VUs  01.0s/45s

running (0m02.0s), 40/40 VUs, 31 complete and 0 interrupted iterations
order_load   [   4% ] 40 VUs  02.0s/45s

running (0m03.0s), 40/40 VUs, 75 complete and 0 interrupted iterations
order_load   [   7% ] 40 VUs  03.0s/45s

running (0m04.0s), 40/40 VUs, 125 complete and 0 interrupted iterations
order_load   [   9% ] 40 VUs  04.0s/45s

running (0m05.0s), 40/40 VUs, 172 complete and 0 interrupted iterations
order_load   [  11% ] 40 VUs  05.0s/45s

running (0m06.0s), 40/40 VUs, 399 complete and 0 interrupted iterations
order_load   [  13% ] 40 VUs  06.0s/45s

running (0m07.0s), 40/40 VUs, 776 complete and 0 interrupted iterations
order_load   [  16% ] 40 VUs  07.0s/45s

running (0m08.0s), 40/40 VUs, 1160 complete and 0 interrupted iterations
order_load   [  18% ] 40 VUs  08.0s/45s

running (0m09.0s), 40/40 VUs, 1536 complete and 0 interrupted iterations
order_load   [  20% ] 40 VUs  09.0s/45s

running (0m10.0s), 40/40 VUs, 1934 complete and 0 interrupted iterations
order_load   [  22% ] 40 VUs  10.0s/45s

running (0m11.0s), 40/40 VUs, 2306 complete and 0 interrupted iterations
order_load   [  24% ] 40 VUs  11.0s/45s

running (0m12.0s), 40/40 VUs, 2696 complete and 0 interrupted iterations
order_load   [  27% ] 40 VUs  12.0s/45s

running (0m13.0s), 40/40 VUs, 3080 complete and 0 interrupted iterations
order_load   [  29% ] 40 VUs  13.0s/45s

running (0m14.0s), 40/40 VUs, 3456 complete and 0 interrupted iterations
order_load   [  31% ] 40 VUs  14.0s/45s

running (0m15.0s), 40/40 VUs, 3840 complete and 0 interrupted iterations
order_load   [  33% ] 40 VUs  15.0s/45s

running (0m16.0s), 40/40 VUs, 4216 complete and 0 interrupted iterations
order_load   [  36% ] 40 VUs  16.0s/45s

running (0m17.0s), 40/40 VUs, 4600 complete and 0 interrupted iterations
order_load   [  38% ] 40 VUs  17.0s/45s

running (0m18.0s), 40/40 VUs, 4976 complete and 0 interrupted iterations
order_load   [  40% ] 40 VUs  18.0s/45s

running (0m19.0s), 40/40 VUs, 5360 complete and 0 interrupted iterations
order_load   [  42% ] 40 VUs  19.0s/45s

running (0m20.0s), 40/40 VUs, 5736 complete and 0 interrupted iterations
order_load   [  44% ] 40 VUs  20.0s/45s

running (0m21.0s), 40/40 VUs, 6120 complete and 0 interrupted iterations
order_load   [  47% ] 40 VUs  21.0s/45s

running (0m22.0s), 40/40 VUs, 6496 complete and 0 interrupted iterations
order_load   [  49% ] 40 VUs  22.0s/45s

running (0m23.0s), 40/40 VUs, 6896 complete and 0 interrupted iterations
order_load   [  51% ] 40 VUs  23.0s/45s

running (0m24.0s), 40/40 VUs, 7280 complete and 0 interrupted iterations
order_load   [  53% ] 40 VUs  24.0s/45s

running (0m25.0s), 40/40 VUs, 7656 complete and 0 interrupted iterations
order_load   [  56% ] 40 VUs  25.0s/45s

running (0m26.0s), 40/40 VUs, 8040 complete and 0 interrupted iterations
order_load   [  58% ] 40 VUs  26.0s/45s

running (0m27.0s), 40/40 VUs, 8416 complete and 0 interrupted iterations
order_load   [  60% ] 40 VUs  27.0s/45s

running (0m28.0s), 40/40 VUs, 8800 complete and 0 interrupted iterations
order_load   [  62% ] 40 VUs  28.0s/45s

running (0m29.0s), 40/40 VUs, 9186 complete and 0 interrupted iterations
order_load   [  64% ] 40 VUs  29.0s/45s

running (0m30.0s), 40/40 VUs, 9576 complete and 0 interrupted iterations
order_load   [  67% ] 40 VUs  30.0s/45s

running (0m31.0s), 40/40 VUs, 9960 complete and 0 interrupted iterations
order_load   [  69% ] 40 VUs  31.0s/45s

running (0m32.0s), 40/40 VUs, 10336 complete and 0 interrupted iterations
order_load   [  71% ] 40 VUs  32.0s/45s

running (0m33.0s), 40/40 VUs, 10720 complete and 0 interrupted iterations
order_load   [  73% ] 40 VUs  33.0s/45s

running (0m34.0s), 40/40 VUs, 11116 complete and 0 interrupted iterations
order_load   [  76% ] 40 VUs  34.0s/45s

running (0m35.0s), 40/40 VUs, 11496 complete and 0 interrupted iterations
order_load   [  78% ] 40 VUs  35.0s/45s

running (0m36.0s), 40/40 VUs, 11880 complete and 0 interrupted iterations
order_load   [  80% ] 40 VUs  36.0s/45s

running (0m37.0s), 40/40 VUs, 12256 complete and 0 interrupted iterations
order_load   [  82% ] 40 VUs  37.0s/45s

running (0m38.0s), 40/40 VUs, 12640 complete and 0 interrupted iterations
order_load   [  84% ] 40 VUs  38.0s/45s

running (0m39.0s), 40/40 VUs, 13016 complete and 0 interrupted iterations
order_load   [  87% ] 40 VUs  39.0s/45s

running (0m40.0s), 40/40 VUs, 13416 complete and 0 interrupted iterations
order_load   [  89% ] 40 VUs  40.0s/45s

running (0m41.0s), 40/40 VUs, 13800 complete and 0 interrupted iterations
order_load   [  91% ] 40 VUs  41.0s/45s

running (0m42.0s), 40/40 VUs, 14176 complete and 0 interrupted iterations
order_load   [  93% ] 40 VUs  42.0s/45s

running (0m43.0s), 40/40 VUs, 14560 complete and 0 interrupted iterations
order_load   [  96% ] 40 VUs  43.0s/45s

running (0m44.0s), 40/40 VUs, 14936 complete and 0 interrupted iterations
order_load   [  98% ] 40 VUs  44.0s/45s

running (0m45.0s), 40/40 VUs, 15336 complete and 0 interrupted iterations
order_load   [ 100% ] 40 VUs  45.0s/45s


  █ TOTAL RESULTS 

    checks_total.......: 15376   340.936715/s
    checks_succeeded...: 100.00% 15376 out of 15376
    checks_failed......: 0.00%   0 out of 15376

    ✓ got a response (status != 0)

    CUSTOM
    orders_conflict_409............: 15167  336.302495/s
    orders_servererror_500.........: 9      0.19956/s
    orders_success_200.............: 200    4.434661/s

    HTTP
    http_req_duration..............: avg=16.81ms  min=1.54ms   med=4.15ms   max=2.16s p(90)=5.18ms   p(95)=5.77ms   p(99)=653.03ms
      { expected_response:true }...: avg=921.72ms min=186.02ms med=784.83ms max=2.16s p(90)=1.39s    p(95)=1.84s    p(99)=2.1s    
    http_req_failed................: 98.69% 15176 out of 15376
    http_reqs......................: 15376  340.936715/s

    EXECUTION
    iteration_duration.............: avg=117.24ms min=101.71ms med=104.48ms max=2.27s p(90)=105.55ms p(95)=106.22ms p(99)=753.28ms
    iterations.....................: 15376  340.936715/s
    vus............................: 40     min=40             max=40
    vus_max........................: 40     min=40             max=40

    NETWORK
    data_received..................: 4.3 MB 96 kB/s
    data_sent......................: 4.5 MB 99 kB/s



running (0m45.1s), 00/40 VUs, 15376 complete and 0 interrupted iterations
order_load ✓ [ 100% ] 40 VUs  45s